Repository: ferm32/cdcat-rus
Catalog: cdcat.po
Languages: ru

source: You can search with regex or windows style wildcards ( ?,*). You can limit the searching to media or media owners. The program optionally can matching with filenames,directory names, comments and all mp3 tags.
ru: Вы можете искать с применением регулярных выражений или шаблонов в стиле Windows ( ?,*). Вы можете ограничиться поиском на определённых носителях или по их владельцам. При желании программа может искать по именам файлов, папок, комментариям и по mp3-тэгам.

source: You can see the modifications between the versions in the ${1}
ru: Изменения от версии к версии можно посмотреть в ${1}

source: zlib data compression library
ru: библиотека для работы со сжатыми данными zlib

source: zlib data compression library (ver &gt;= 1.1.4)
ru: библиотека для работы со сжатыми данными zlib (версии &gt;= 1.1.4)
