Repository: ferm32/cdcat-rus
Catalog: cdcat.po
Languages: ru

source: 01. Aug 2012
ru: 1 августа 2012 г.

source: 02. Aug. 2012
ru: 2 августа 2012 г.

source: 03. Feb 2011
ru: 3 февраля 2011 г.

source: 04. Jan 2013
ru: 4 января 2013 г.

source: 08. Feb. 2012
ru: 8 февраля 2012 г.

source: 08. Mar 2011
ru: 8 марта 2011 г.

source: 12. Aug 2011
ru: 12 августа 2011 г.

source: ${1} (${2}) released.
ru: Выпущена ${1} (${2}).

source: ${1} (${2}) released. This release contains a lot of fixes and some new features. Also patches for ${3} and updated versions of ${4} now available.
ru: Выпущена ${1} (${2}), со многими исправлениями и несколькими новыми функциями. Кроме того, теперь доступны патчи для ${3} и обновлённые версии ${4}.

source: ${1} (${2}) released. This release contains a lot of new features and fixes.
ru: Выпущена ${1} (${2}) со многими новыми функциями и исправлениями.

source: 13. May 2012
ru: 13 мая 2012 г.

source: 15. May 2012
ru: 15 мая 2012 г.

source: 17. Feb 2012
ru: 17 февраля 2012 г.

source: 17. Nov 2010
ru: 17 ноября 2010 г.

source: 19. Feb 2012
ru: 19 февраля 2012 г.

source: ${1} uploaded.
ru: Доступна для скачивания ${1}.

source: ${1} version:
ru: версия ${1}:

source: 21. Okt 2012
ru: 21 октября 2012 г.

source: 22. Jan 2011
ru: 22 января 2011 г.

source: 24. Nov 2010
ru: 24 ноября 2010 г.

source: 29. Jan 2012
ru: 29 января 2012 г.

source: 29. Mar 2012
ru: 29 марта 2012 г.

source: 30. May 2011
ru: 30 мая 2011 г.

source: 5. Aug 2011
ru: 5 августа 2011 г.

source: Additional programmers
ru: Участвовали в разработке

source: After you subsribe the mail address of the list is:
ru: После того, как вы подпишетесь, адрес электронной почты списка рассылки будет:

source: album
ru: альбом

source: All Files are signed by the public sign key (${1}) using ${2}.
ru: Все файлы подписаны публичным ключом (${1}) с использованием ${2}.

source: All libraries except lib7zip and mediainfo are included in the Linux distributions. You will need the development packages if they too if you compile from source.
ru: Все библиотеки, за исключением lib7zip и mediainfo уже есть в дистрибутивах Linux. Если вы захотите компилировать программу из исходников, вам понадобятся пакеты инструментов разработчика.

source: Animated symbol in system tray, minizing of the main window into dock possible
ru: Анимированный значок в панели задач для быстрого свёртывания главного окна

source: artist
ru: исполнитель

source: Author
ru: Автор

source: Author of CdCat
ru: Автор CdCat

source: Author, questions, patches:
ru: Автор, обратная связь для вопросов и патчей:

source: Autoload database on startup
ru: Автозагрузка базы данных при запуске программы

source: Batch file renamer ${1}
ru: Командный файл для переименования ${1}

source: Binary for ${1}:
ru: Готовые пакеты для ${1}:

source: Binary for linux:
ru: Готовые пакеты для Linux:

source: Binary for MacOS/X (untested):
ru: Готовые пакеты для MacOS/X (требует тестирования):

source: Binary for OS/2: (ecomstation):
ru: Готовые пакеты для OS/2: (ecomstation):

source: Binary for Windows:
ru: Готовые пакеты для Windows:

source: Bug reports, Questions, Request, Patches, etc:
ru: Отчёты об ошибках, вопросы, запросы новых функций, патчи и т. д.:

source: Bug tracker:
ru: Система отслеживания ошибок:

source: Bugtracker at Sourceforge: ${1}
ru: Система отслеживания ошибок на Sourceforge: ${1}

source: Can mount/umount/eject the cd-drive on Linux
ru: Может монтировать/размонтировать/извлекать CD/DVD-диск под Linux

source: Category support *
ru: Поддержка категорий *

source: Cdcat can store the content of some specified files up to a size limit if you want. (for example: *.nfo)
ru: Cdcat может сохранять содержимое файлов указанного типа (например: *.nfo), для которых можно указать максимальный размер.

source: CdCat, Catalog ,CD ,DVD ,mp3 ,data , Hyper,XML ,qt4, gzip, bzip2, tar, 7zip, lib7zip, 7z, Multiplatform, Linux, Windows, MacOS/X, OS/2, ecomstation
ru: CdCat, Каталог ,CD ,DVD, mp3 ,данные , Hyper,XML ,Qt4, gzip, bzip2, tar, 7zip, lib7zip, 7z, мультиплатформенный, Linux, Windows, MacOS/X, OS/2, ecomstation

source: CdCat, Catalog ,CD, DVD,mp3, data , Hyper,XML ,qt4, gzip, bzip2, tar, 7zip, lib7zip, 7z, Multiplatform, Linux, Windows, MacOS/X, OS/2, ecomstation
ru: CdCat, Каталог ,CD, DVD,mp3, данные , Hyper,XML ,Qt4, gzip, bzip2, tar, 7zip, lib7zip, 7z, Мультиплатформенный, Linux, Windows, MacOS/X, OS/2, ecomstation

source: CdCat - Multiplatform Media Catalog Program
ru: CdCat - мультиплатформенная программа-каталогизатор различный носителей

source: cdcat team
ru: команда cdcat

source: ChangeLog
ru: История изменений

source: Changes
ru: изменения

source: Click to view ${1}version.
ru: Нажмите, чтобы просмотреть версию ${1}.

source: comment
ru: комментарий

source: compile page
ru: страница компиляции

source: Compiling
ru: Компиляция

source: Compiling:
ru: Компиляция:

source: Contact
ru: Контакты

source: Contact author by email:
ru: Связаться с автором по эл. почте:

source: Contains the directory browser, the file browser, and the comment frame which shows: name, size(if the element is file), last modification, the owner(of the media) The name and the number of the media, mp3 tags if exists, and a user comment which editable anytime.
ru: Содержит просмотрцик дерева папок, файлов и окно комментария, которое отображает: имя, размер (для файла), время последнего изменения, владельца (носителя), имя и номер носителя, тэги mp3 (если они есть) и произвольный комментарий, который можно изменить в любое время.

source: content
ru: содержимое

source: Current version:
ru: Текущая версия:

source: Czech
ru: Чешский

source: Description:
ru: Описание:

source: Development source access:
ru: Доступ к исходным файлам для разработчиков:

source: directory name
ru: имя папки

source: Discuss on IRC: #cdcat on irc.freenode.net
ru: Обсуждение по IRC: канал #cdcat на irc.freenode.net

source: Display progress at scan *
ru: Отображение прогресса сканирования *

source: docksymbol
ru: значок для быстрого свёртывания окна

source: download
ru: скачать

source: Download
ru: Скачать

source: Downloading cdcat
ru: Скачать cdcat

source: download page
ru: Страница скачивания

source: download statistics
ru: статистика скачивания

source: E-mail:
ru: Адрес e-mail:

source: Email:
ru: Адрес e-mail:

source: end date *
ru: дата окончания *

source: Englisch
ru: Английский

source: English only
ru: Только английский

source: (English or German)
ru: (английский или немецкий)

source: expat XML parsing library
ru: библиотека разбора expat XML

source: expat XML parsing library (ver &gt;= 1.95.2) (not needed with >= 1.1beta2)
ru: библиотека разбора expat XML (версии &gt;= 1.95.2) (не требуется для версий >= 1.1beta2)

source: Export
ru: Экспорт

source: Export of search results to HTML
ru: Экспорт результатов поиска в HTML

source: Extracting exif data from pictures (jpg only)
ru: Извлечение из изображений данных exif (только для jpeg)

source: Extracting exif data from pictures (jpg only, not enabled at win32 builds)
ru: Извлечение из изображений данных exif (только для jpeg, не работает в сборках под Windows)

source: Feature request at Sourceforge:
ru: Запрос новой функциональности через Sourceforge:

source: Features:
ru: Возможности:

source: File Archivist +
ru: Файловый архиватор +

source: file name
ru: имя файла

source: French
ru: Французский

source: from 1.9, optional
ru: начиная с 1.9 необязательна

source: (from germany)
ru: (Германия)

source: (from hungary)
ru: (Венгрия)

source: Full unicode support *
ru: Полная поддержка unicode *

source: German
ru: Немецкий

source: gtktalog (CSV, XML classical)
ru: gtktalog (CSV, классический XML)

source: He had study communication computer sience at university for applied sciences of Wernigerode.
ru: Изучал научные дисциплины, связанные с компьютерными коммуникациями в Университете прикладных наук города Вернигорода.

source: He is programming free software (open source), preferred QT/KDE. He is the current active maintainer.
ru: Программирует свободное программное обеспечение с открытым исходным кодом, предпочитает Qt/KDE. В настоящее время - активный разработчик.

source: He is studying communication computer sience at university for applied sciences of Wernigerode. ${1}He is programming free software (open source), preferred QT/KDE.
ru: Изучал научные дисциплины, связанные с компьютерными коммуникациями в Университете прикладных наук города Вернигорода. ${1} Занимается программированием свободного программного обеспечения (с открытыми исходными текстами), предпочитает Qt/KDE.

source: Help for compiling cdcat can be found in the sourcecode of cdcat:
ru: Информация, необходимая для компиляции cdcat, можно найти в исходных текстах

source: Hungarian
ru: Венгерский

source: Hyper's CD Catalog - author
ru: Hyper's CD Catalog - автор

source: Hyper's CD Catalog - compiling
ru: Hyper's CD Catalog - компиляция

source: Hyper's CD Catalog - other programs
ru: Hyper's CD Catalog - другие программы

source: Hyper's CD Catalog - screenshots
ru: Hyper's CD Catalog - снимки экрана

source: Hyper's other programs:
ru: Другие программы, созданные Hyper:

source: if enabled, supported file extensions:
ru: если включено, поддерживает расширения файлов:

source: If you got error messages try to re-generate the Makefile by running qmake (QT tool)
ru: Если вы получили сообщение об ошибке, попробуйте перегенерировать Makefile с помощью запуска qmake (из инструментария Qt)

source: Import from other catalog programs:
ru: Импорт из других программ-каталогизаторов:

source: improved ${1} uploaded (lib7zip compiled in, 7z.so shipped), ${2} (${3} included) uploaded
ru: Доступен для скачивания улучшенный ${1} (с вкомпилированным lib7zip, есть 7z.so), доступны для скачивания ${2} (${3} включен)

source: Indonesian
ru: Индонезийский

source: Italian
ru: Итальянский

source: Last update
ru: Последнее обновление

source: lib7zip 7zip wrapper library
ru: библиотека-обёртка для 7zip - lib7zip

source: lib7zip 7zip wrapper library(version &gt;= 1.4.1, optional) (from 1.4)
ru: библиотека-обёртка для 7zip - lib7zip (версии &gt;= 1.4.1, необязательна) (начиная с версии 1.4)

source: lib7zip for Linux:
ru: lib7zip для Linux:

source: libbzip2 library
ru: библиотека libbzip2

source: libbzip2 library (version &gt;= 1.0.0) (from 1.4)
ru: библиотека libbzip2 (версии &gt;= 1.0.0) (начиная с 1.4)

source: libexiv exif data library
ru: библиотека для обработки данных exif libexif

source: libexiv Exifdaten-Bibliothek (from 1.9, optional>)
ru: библиотека для обработки данных Exif libexif (начиная с версии 1.9 необязательна)

source: libtar library
ru: библиотека libtar

source: libtar library (version &gt;= 1.2.11) (from 1.4)
ru: бибилиотека libtar (версии &gt;= 1.2.11) (начиная с версии 1.4)

source: License: GPL
ru: Лицензия: GPL

source: Links to other programs
ru: Ссылки на другие программы

source: Linux binary download
ru: Скачать готовый пакет для Linux

source: Linux generic
ru: Обычный Linux

source: Localizion (not all finisched):
ru: Локализации (завершены не все):

source: MacOS/X binary download
ru: Скачать готовый пакет для MacOS/X

source: Mailing list:
ru: Список рассылки:

source: Mailing list (everyone who like to get news, developers, translators):
ru: Список рассылки (для тех, кто хочет получать новости, для разрабочиков и переводчиков):

source: Main window
ru: Главное окно

source: max file size *
ru: максимальный размер файла *

source: mediainfo media info library
ru: библиотека для получения информации о носителе mediainfo

source: mediainfo media info library (version &gt;= 0.7.47) (from 1.5, optional)
ru: библиотека для получения информации о носителе mediainfo (версии &gt;= 0.7.47) (начиная с версии 1.5, необязательна)

source: media name
ru: имя носителя

source: Midnight Commander plugin for .hcf files (cdcat files) source:
ru: Исходные тексты плагина для Midnight Commander для работы с файлами cdcat (.hcf):

source: min file size *
ru: минимальный размер файла *

source: Modern Greek
ru: Современный греческий

source: mp3 tags (artist, title, album, year)
ru: Тэги mp3 (исполнитель, название, альбом, год)

source: My other programs:
ru: Мои другие программы:

source: News:
ru: Новости:

source: Nokia Qt graphic library
ru: Графическая библиотека Nokia Qt

source: Nokia Qt graphic library (ver &gt;= 2.3.0/4.4.0)
ru: графическая библиотека Nokia Qt (версии &gt;= 2.3.0/4.4.0)

source: Note: You only need this, if no binary for your operating system is not available or you want to use the latest development version.
ru: Замечание: Приведённая информация предназначена лишь для тех, кто не нашёл готовой сборки под вашу операционную систиему, или для тех, кто хочет использовать текущий срез исходных текстов (версию для разработчиков).

source: OpenSuSE 12.1 package
ru: Пакет под OpenSuSE 12.1

source: OS/2 (ecomstation) binary download
ru: Скачать готовый пакет для OS/2 (ecomstation)

source: Other programs
ru: Другие программы

source: p7zip library
ru: библиотека p7zip

source: p7zip library (version &gt;= 9.20.1) (from 1.4, optional)
ru: библиотека p7zip (версии &gt;= 9.20.1) (начиная с версии 1.4 не является обязательной)

source: package needed
ru: устанавливаются отдельно

source: packages for ${1} uploaded (incl. ${2}). Note: mediainfo is disabled because no package available.
ru: Доступны для скачивания пакеты для ${1} (вкл. ${2}). Замечание: mediainfo отключена, потому что нет доступного пакета.

source: Packages for Debian Lenny and Ubuntu Oneiric uploaded (incl. lib7zip).
ru: Доступны для скачивания пакеты под Debian Lenny и Ubuntu Oneiric (lib7zip включён).

source: pcre Perl compatible regular expression library
ru: библитека для работы с Perl-совместимыми регулярными выражениями pcre

source: pcre Perl compatible regular expression library (ver &gt;= 3.9) (not needed with >= 1.1beta2)
ru: библитека для работы с Perl-совместимыми регулярными выражениями pcre (версии &gt;= 3.9) (не требуется для версий >= 1.1beta2)

source: Platform indepentent Gzipped XML format.
ru: Платформо-независимый сжатый с помощью Gzip формат XML

source: Polish
ru: Польский

source: Portogisian
ru: Португальский

source: Possibility to add comment for files or directories.
ru: Возможность добавления комментариев для файлов или папок.

source: Prerequisites:
ru: Требования:

source: Print search results
ru: Распечатка результатов поиска

source: Progress at loading catalog (useful at big size) *
ru: Отображение прогресса загрузки каталога (полезно для больших объёмов данных) *

source: Qt3 version:
ru: Версия Qt3:

source: Qt4 ${1} available. First error corrections are done. More infos available at the ${2}.
ru: Доступен ${1} для Qt4. Сделаны первые исправления ошибок. Дополнительная информация доступна на${2}.

source: Qt4 version
ru: Версия Qt4

source: Read file content from the specified files (e.g: *.nfo)
ru: Чтение содержимого файлов указанного типа (например, *.nfo)

source: Reading *.nfo and *.diz files
ru: Чтение файлов *.nfo и *.diz

source: Reading of the filesystem structure from archives
ru: Чтение стуктуры файловой системы из архивов

source: Reading technical file information
ru: Чтение технической информации файла

source: Read mp3 tags (if you enable it)
ru: Чтение тэгов mp3 (при активации данной функции)

source: Request new features:
ru: Запрос новых возможностей:

source: Russian
ru: Русский (автор ferm32)

source: saved file content can open with user defined program
ru: сохранённое содержимое файла может быть открыто программой по умолчанию

source: Saving thumbnails pictures of pictures inside catalog
ru: Сохранение миниатюр изображений внутри каталога

source: Screenshots
ru: Снимки экрана

source: Searching window
ru: Окно поиска

source: Searching with regex or wildcards:
ru: Поиск и использованием шаблонов и регулярных выражений

source: Serbian
ru: Сербский

source: Skip files /directories on scanning using regular expressions or wildcards
ru: Пропустить файлы / папки при сканировании в соответствии с шаблоном или регулярным выражением

source: Source code:
ru: Исходные тексты:

source: Source code repository
ru: репозиторий с исходными текстами

source: Spain
ru: Испанский

source: start date *
ru: дата начала *

source: Subscribe at mailinglist:
ru: Подписаться на список рассылки:

source: Subscribe page:
ru: Страница для подписки:

source: supported file extensions:
ru: поддерживаемые расширения файлов:

source: testing
ru: тестирования

source: Than you even got error messages try to check dependencies and rights!${1} (before you send me bug report :-) )
ru: Если вы всё равно получаете сообещния об ошибках, перед тем, как слать мне рапорт об ошибке, попробуйте проверить зависимости и права!${1}

source: That case you didn't get any error login as root and type: ${1}${2}${3}${4} This command copy the compiled files to the necessary place.
ru: В случае, если вы не получили сообщений об ошибке, зарегестрируйтесь как root и наберите: ${1}${2}${3}${4} Эта команда скопирует скомпилированные файлы в положенное место.

source: The 7zip library (7z.so/7z.dll) must be available at runtime for supporting a lot of file extensions at archive scanning. You can check if its loaded if there is a long list of file extensions at settings - Select additional items to read - supported file extensions.
ru: Библиотека 7zip (7z.so/7z.dll) должна быть доступна во время выполнения программы для поддержки при сканировании архивов множества файловых расширений. Вы можете проверить, загружена ли она, поискав длинный список поддерживаемых файловых расширений в настройках - Выбрать дополнительные элементы для чтения - поддерживаемые расширения файлов.

source: The authenticy of a file can be checked using the corresponding ${1} file:
ru: Подлинность файла может быть проверена с использованем соответствующего файла ${1}:

source: The author is studied computer programming at University of Debrecen, and tried to write many useful programs for everyone on the world who likes its.
ru: Автор проходил обучение программированию компьютеров в Университете Дебрецена, и пробовал пискать множество полезных программ для всех тех во всём мире, кому они могли понравится.

source: The author is studied computer programming at University of Debrecen, and tried to write many useful programs for everyone on the world who likes its. He moved avay from cdcat development.
ru: Автор проходил обучение программированию компьютеров в Университете Дебрецена, и пробовал пискать множество полезных программ для всех тех во всём мире, кому они могли понравится. В разработке cdcat он больше не учавствует.

source: The cdcat is graphical (QT based) multiplatform (Linux / Windows / MacOS/X / OS/2) catalog program which scans the directories/drives you want and memoryze the filesystem (including the tags of mp3's) and store it in a small file. The used license is GPL. The database is stored in a gzipped XML format, so you can hack it, or use it if necessary :-)
ru: Cdcat - это графическая (на базе Qt) многоплатформенная (Linux / Windows / MacOS/X / OS/2) программа-каталогизатор, которая сканирует заданные вами папки/диски и собирает сведения о файловой системе (включая mp3-тэги) и сохраняет их в небольшом файле. Тип лицензии - GPL. База данных сохраняется в сжатом с применением gzip формате XML, поэтому вы можете, если это необходимо, заглянуть в него и как-либо использовать. :-)

source: The development of cdcat continues! The new maintainer is now Christoph Thielecke. The first step is the new Beta which is ported to Qt4 for ${1} available.
ru: Разработка cdcat продожена! Теперь его сопровождает Christoph Thielecke. Первым его шагом стал выпуск новой бета-версии, которая портирована под Qt4 для ${1}.

source: The dock symbol:
ru: Значок для быстрого свёртывания:

source: The lib7zip library compiling requires the p7zip sourcecode (WIN32: 7zip sourcecode).
ru: Компиляция библиотеки lib7zip требует наличия исходных текстов p7zip (в случае Windows - исходных текстов 7zip).

source: The main program was written by ${1}
ru: Основная программа была написана ${1}

source: The main program was written by ${1} (from hungary)
ru: Основная программа была написана ${1} (Венгрия)

source: The main window:
ru: Главное окно:

source: The mediainfo library is optional. At compile time the mediainfo header file (${1}) must be in include pfad (subfolder MediaInfoDLL)
ru: Наличие библиотеки midiainfo необязательно. Во время компиляции файл заголовка mediainfo (${1}) должен присутствовать в подпапке MediaInfoDLL

source: then type:
ru: далее наберите:

source: The searching window:
ru: Окно поиска:

source: The status line (bottom) shows the full path of the actual element.
ru: Строка статуса (снизу) отображает полный путь текущего элемента.

source: The status line (bottom) shows the full path of the actual element.${1}
ru: Строка статуса (снизу) отображает полный путь текущего элемента.${1}

source: This release adds archive file scan support which also requires now libbzip2, libtar, p7zip/7zip (lib) and lib7zip. Read more at ${1}
ru: В данном выпуске добавлена поддержка сканирования архивных файлов, которая требует наличия библиотек libbzip2, libtar, p7zip/7zip and lib7zip. Подробнее здесь ${1}

source: This release contains a lot of fixes.
ru: Этот выпуск содержит множестов исправлений.

source: This release contains a lot of new features and fixes. The Qt3 compat classes are no longer nessary.OS/2 (ecomstation) are now supported.
ru: Этот выпуск содержит множество новых возможностей и исправлений. Классы совместимости Qt3 более не нужны. Добавлена поддержка OS/2 (ecomstation).

source: title
ru: заголовок

source: track
ru: трек

source: Unpack the source, and check te prerequisites! If it is done, check or set the QTDIR envronment variable (It must point the root directory of Qt.)
ru: Распакуйте исходные тексты, и проверьте выполнение требований для сборки. Если они выполнены, проверьте наличие переменной окружения QTDIR (она должна указывать на корневую папку с Qt).

source: Unsharp search
ru: Нестрогий поиск

source: ver >= 3.9, not needed with >= 1.1beta2
ru: версии >= 3.9, не требутеся для >= 1.1beta2

source: version >= 0.7.47, from 1.5, optional
ru: версии >= 0.7.47, начиная с 1.5 не является обязательной

source: version >= 1.0.0, from 1.4
ru: версии >= 1.0.0, начиная с 1.4

source: version >= 1.1.4
ru: версии >= 1.1.4

source: version >= 1.2.11, from 1.4
ru: версии >= 1.2.11, начиная с 1.4

source: version >= 1.4.1, from 1.4, optional
ru: версии >= 1.4.1, начиная с 1.4, не является обязательной

source: version >= 1.95.2, not needed with >= 1.1beta2
ru: версии >= 1.95.2, не требуется для >= 1.1beta2

source: Version 1.9 under Linux
ru: Версия 1.9 под Linux

source: Version 2.0 under OS/2
ru: Версия 2.0 под OS/2

source: Version 2.0 under Windows
ru: Версия 2.0 под Windows

source: version >= 2.3.0/4.4.0
ru: версии >= 2.3.0/4.4.0

source: version >= 9.20.1, from 1.4, optional
ru: версии >= 9.20.1, начиная с 1.4, не является обязательной

source: View entries:
ru: Система отслеживания ошибок (tickets tracker):

source: View page with english language.
ru: Страница просмотра (английский язык).

source: Virtual Volumes View (CSV) *
ru: Просмотр виртуальных томов (CSV) *

source: What's this?
ru: Что это?

source: When the resoults of the searching is done, the main window always shows the actual element in the list of results.
ru: Когда результаты поиска будут найдены, главное окно в списке результатов всегда отображает текущий элемент.

source: windows:
ru: окна:

source: Windows binary download
ru: Скачать готовый пакет для Windows

source: Write a message to list:
ru: Написать сообщение в список рассылки:

source: year
ru: год
